const About = () => {
    return (
        <div className="About border border-dark rounded p-3">
            <h1>About</h1>
            <p className="border border-dark rounded p-2 m-0">
                Текст (от лат. textus — ткань; сплетение, сочетание) —
                зафиксированная на каком-либо материальном носителе человеческая мысль; в общем плане связная и полная
                последовательность символов.
                Существуют две основные трактовки понятия «текст»: имманентная (расширенная, философски нагруженная) и
                репрезентативная (более частная). Имманентный подход подразумевает отношение к тексту как к автономной
                реальности, нацеленность на выявление его внутренней структуры. Репрезентативный — рассмотрение текста
                как особой формы представления информации о внешней тексту действительности.
                В лингвистике термин «текст» используется в широком значении, включая и образцы устной речи. Восприятие
                текста изучается в рамках лингвистики текста и психолингвистики. Так, например, И. Р.
                Гальперин определяет текст следующим образом: «Это письменное сообщение, объективированное в виде
                письменного документа, состоящее из ряда высказываний, объединённых разными типами лексической,
                грамматической и логической связи, имеющее определённый модальный характер,
                прагматическую установку и соответственно литературно обработанное»
            </p>
        </div>
    );
};

export default About;